app/views/equipos/index.html.erb

SELECT  "arriendos".* FROM "arriendos" WHERE "arriendos"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---
            <% if params[:nroarr].present? %>
              <td><%= link_to 'Arrendar', new_arriendo_path(:eq => equipo.id, :arr => Arriendo.find(params[:nroarr]).id) %></td>