app/views/equipos/show.html.erb

SELECT  "arriendos".* FROM "arriendos" WHERE "arriendos"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
---
      <p>
      <%= link_to 'Arrendar', new_arriendo_path(:eq => @equipo.id, :arr => Arriendo.find(params[:na]).id) %>