app/controllers/arriendos_controller.rb

SELECT "arriendos".* FROM "arriendos" ORDER BY fecha
---
  def index
    @arriendos = Arriendo.all

INSERT INTO "arriendos" ("talla", "nropedido", "user_id", "equipo_id", "created_at", "updated_at", "fecha") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["talla", 2], ["nropedido", "1524116910A1"], ["user_id", 1], ["equipo_id", 1], ["created_at", "2018-04-19 05:48:40.786580"], ["updated_at", "2018-04-19 05:48:40.786580"], ["fecha", "2018-11-16"]]
---
  def create
    @arriendo = Arriendo.new(arriendo_params)

    respond_to do |format|
      if @arriendo.save

UPDATE "arriendos" SET "talla" = $1, "altura" = $2, "edad" = $3, "peso" = $4, "nombre" = $5, "apellidop" = $6, "apellidom" = $7, "updated_at" = $8 WHERE "arriendos"."id" = $9  [["talla", 2], ["altura", 2], ["edad", 2], ["peso", 2], ["nombre", "Alejandro"], ["apellidop", "Gutierrez"], ["apellidom", "Riesco"], ["updated_at", "2018-04-17 09:39:56.171431"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @arriendo.update(arriendo_params)

DELETE FROM "arriendos" WHERE "arriendos"."id" = $1  [["id", 10]]
---
  def destroy
    @arriendo.destroy

SELECT  "arriendos".* FROM "arriendos" WHERE "arriendos"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_arriendo
      @arriendo = Arriendo.find(params[:id])