app/controllers/homes_controller.rb

  def create
    @home = Home.new(home_params)

    respond_to do |format|
      if @home.save
---
INSERT INTO "homes" ("created_at", "updated_at", "snowforecast", "camino") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2018-04-17 23:53:01.783189"], ["updated_at", "2018-04-17 23:53:01.783189"], ["snowforecast", "good"], ["camino", "fine"]]

  def update
    respond_to do |format|
      if @home.update(home_params)
---
UPDATE "homes" SET "snowforecast" = $1, "camino" = $2, "updated_at" = $3 WHERE "homes"."id" = $4  [["snowforecast", "clear"], ["camino", "good"], ["updated_at", "2018-04-16 09:21:18.549222"], ["id", 1]]