app/controllers/users_controller.rb

    def set_user
      if params[:id] = "sign_out"
        sign_out current_user
      else
        @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]