app/views/arriendos/_form0.html.erb

SELECT  "arriendos".* FROM "arriendos" WHERE "arriendos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      <div class="field">
        <%= f.hidden_field :nropedido, :value => Arriendo.find(params[:arr]).nropedido %>