app/views/arriendos/_form.html.erb

      <div class="field">
        <%= f.hidden_field :nropedido, :value => Arriendo.find(params[:arr]).nropedido %>
---
SELECT  "arriendos".* FROM "arriendos" WHERE "arriendos"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]

      <div class="field">
        <%= f.hidden_field :nropedido, :value => Time.current.to_i.to_s + Equipo.find(id).name[0..2].upcase + id.to_s%>
---
SELECT  "equipos".* FROM "equipos" WHERE "equipos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]