app/views/arriendos/index.html.erb

    <div> Arriendo listo, revise su email para confirmarlo! </div>
    <% send_email(Arriendo.find(params[:arrid])) %>
---
SELECT  "arriendos".* FROM "arriendos" WHERE "arriendos"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

                      </tr>
                      <% @repeat.push(arriendo.nropedido) %>
---
UPDATE "arriendos" SET "user_id" = $1, "updated_at" = $2 WHERE "arriendos"."id" = $3  [["user_id", 3], ["updated_at", "2018-04-20 05:24:17.488550"], ["id", 9]]