app/views/arriendos/new.html.erb

SELECT  "equipos".* FROM "equipos" WHERE "equipos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<% if params[:arr].present? %>
  <%= render 'form', arriendo: @arriendo, id: Equipo.find(params[:eq]).id %>