app/views/arriendos/show.html.erb

  <%@nro = @arriendo.nropedido%>
  <% Arriendo.all.each do |arr| %>
---
SELECT "arriendos".* FROM "arriendos"

        <div  class = "jumbotron" style="background-color: #ffcc66">
          <strong> <%= Equipo.find(arr.equipo_id).name %> </strong>
---
SELECT  "equipos".* FROM "equipos" WHERE "equipos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]