app/views/checkins/index.html.erb

SELECT "arriendos".* FROM "arriendos" WHERE "arriendos"."nropedido" = $1  [["nropedido", "deleted"]]
---
<%= :deleted%>
<% Arriendo.where(nropedido: :deleted).each do |arriendo|%>